{
  "architectures": [
    "CustomSplitLLamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "hidden_act": "silu",
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "model_type": "custom_split_llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 40,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.0",
  "use_cache": true,
  "vocab_size": 128256,

  "_comment": "Custom Split LLaMA Configuration",
  "path8b": "/path/to/llama-8b-model",
  "path70b": "/path/to/llama-70b-model",
  "num_layers_8": 32,
  "num_layers_70": 8,
  "mlp": false,

  "_usage": [
    "This configuration file should be saved as config.json in your model directory.",
    "Update path8b and path70b to point to your actual model paths.",
    "num_layers_8: Number of layers to use from the 8B model (first layers)",
    "num_layers_70: Number of layers to use from the 70B model (last layers)",
    "mlp: Set to true to use MLP adapter (linear + relu + linear), false for single linear adapter",
    "Total model depth will be: num_layers_8 + 1 (adapter) + num_layers_70"
  ]
}
